{
	"amdocs": {
		"orgName": "Amdocs",
		"duration": "2021 - Currently Working",
		"briefDescription": "Developed responsive web apps using React.js, TypeScript, and Redux for state management. Utilized React Hooks for efficient state and lifecycle management. Integrated AEM components for personalized user experiences. Collaborated with backend teams to enhance app functionalities via RESTful APIs and Java. Conducted code reviews to ensure quality and adherence to best practices. Worked with cross-functional teams to deliver projects on time. Implemented features, resolved bugs, and contributed to legacy code migration for improved maintainability and scalability.",
		"longDescription": "1. Developed and maintained responsive and high-performance web applications using React.js, JavaScript and TypeScript.\n2. Leveraged Redux for state management to ensure a predictable and centralized state across the application.\n3. Utilized React Hooks to manage component state and lifecycle efficiently, promoting clean and reusable code.\n4. Integrated and customized AEM components to deliver personalized and content-rich user experiences.\n5. Collaborated with backend teams to integrate RESTful APIs and enhance application functionalities using Java.\n6. Participated in code reviews, ensuring adherence to best practices and high code quality standards.\n7. Worked closely with cross-functional teams to deliver projects on time and within scope, contributing to overall project success.\n8. Successfully implemented complex features and resolved critical bugs, enhancing user satisfaction and retention.\n9. Actively contributed to the migration of legacy code to modern JavaScript standards, improving maintainability and scalability."
	},
	"infy": {
		"orgName": "Infosys",
		"duration": "2019 - 2021",
		"briefDescription": "Worked on a comprehensive web application to facilitate loan processing services for Westpac, one of Australia's largest banking institutions. Implemented diverse UI components utilizing React Redux to ensure an intuitive user experience. Developed REST APIs in Node.js to retrieve data from the Oracle Banking Platform and Java Spring Boot APIs, catering to different user interactions and requirements. Engineered REST APIs in Java Spring Boot to fetch data from the Oracle Banking Platform, enhancing functionality and responsiveness based on user interactions.",
		"longDescription": "1. Worked on a comprehensive web application to facilitate loan processing services for Westpac, one of Australia's largest banking institutions.\n2. Implemented diverse UI components utilizing React Redux to ensure an intuitive user experience.\n3. Developed REST APIs in Node.js to retrieve data from the Oracle Banking Platform and Java Spring Boot APIs, catering to different user interactions and requirements.\n4. Engineered REST APIs in Java Spring Boot to fetch data from the Oracle Banking Platform, enhancing functionality and responsiveness based on user interactions."
	},
	"project1": {
		"orgName": "Leave tracker and Capacity planner web Application",
		"briefDescription": "Developing a web application to streamline the leave process for Scrum teams using React.js, Java Spring Boot, and MySQL, enabling employees to apply for leave and Scrum Masters to plan sprint capacity efficiently.",
		"longDescription": ""
	},
	"project2": {
		"orgName": "Web Application for searching flatmate",
		"briefDescription": "Developed a web app facilitating home sharing. Users can list homes or find flatmates. Used React.js for the front-end, Django Rest Framework for the back-end and MySQL for the database.",
		"longDescription": ""
	},
	"project3": {
		"orgName": "Peer to peer Messaging Application",
		"briefDescription": "Created a react native application for peer to peer sending messages with FireStore as database.",
		"longDescription": ""
	},
	"project4": {
		"orgName": "Brain Tumor Detection using CNN",
		"briefDescription": "Created and trained a Convolutional Neural Network model for classifying the Brain MRI into Benign and Malignant.",
		"longDescription": ""
	}
}